app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["created_at", "2016-01-11 07:24:40.279130"], ["updated_at", "2016-01-11 07:24:40.279130"]]
---
	def create
		creature_params = params.require(:creature).permit(:name, :description)

		creature = Creature.new(creature_params)

		if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 0]]
---
	def show

		creature_id = params[:id]

		@creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		creature_id = params[:id]

		@creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "name" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["name", "Steve"], ["updated_at", "2016-01-11 07:44:46.644330"], ["id", 1]]
---
	def update
		creature_id = params[:id]

		creature = Creature.find_by_id(creature_id)

		creature_params = params.require(:creature).permit(:name, :description)

		creature.update_attributes(creature_params)